# "Менеджер заметок"
# Grade 1.Этап 1. Задание 1.
# Определяем переменные
username = "Денис Федорович"  # Имя пользователя
title = "Покупка продуктов"  # Заголовок заметки
content = "Купить молоко, хлеб и яйца."  # Описание заметки
status = "Активна"  # Статус заметки
created_date = "03-12-2024"  # Дата создания заметки
issue_date = "10-12-2024"  # Дата истечения заметки

# Вывод значений переменных
print("Имя пользователя:", username)
print("Заголовок заметки:", title)
print("Описание заметки:", content)
print("Статус заметки:", status)
print("Дата создания заметки:", created_date)
print("Дата истечения заметки:", issue_date)

